konf/src/Documents/ВКМ_НазначениеСотрудниковНаДолжности/ВКМ_НазначениеСотрудниковНаДолжности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_НазначениеСотрудниковНаДолжности</name>
  <registerRecords>InformationRegister.ВКМ_ДолжностиСотрудников</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДолжностиСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.ВКМ_ДолжностиСотрудников</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНазначения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.ВКМ_Подразделения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

konf/src/InformationRegisters/ВКМ_ДолжностиСотрудников/ВКМ_ДолжностиСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_ДолжностиСотрудников</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ВКМ_ДолжностиСотрудников</types>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ВКМ_Подразделения</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТабельныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

konf/src/Documents/ВКМ_НазначениеСотрудниковНаДолжности/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ОбработчикиСобытий 
	
	Процедура ОбработкаПроведения(Отказ, Режим)
		
		Запрос = Новый Запрос();
		
		Запрос.Текст = "ВЫБРАТЬ
		|	ВКМ_НазначениеСотрудниковНаДолжностиВКМ_ДолжностиСотрудников.Должность КАК Должность,
		|	ВКМ_НазначениеСотрудниковНаДолжностиВКМ_ДолжностиСотрудников.Подразделение КАК Подразделение,
		|	ВКМ_НазначениеСотрудниковНаДолжностиВКМ_ДолжностиСотрудников.Сотрудник.Код КАК ТабельныйНомер,
		|	ВКМ_НазначениеСотрудниковНаДолжностиВКМ_ДолжностиСотрудников.Сотрудник КАК Сотрудник,
		|	ВКМ_НазначениеСотрудниковНаДолжностиВКМ_ДолжностиСотрудников.ДатаНазначения КАК ДатаНазначения
		|ИЗ
		|	Документ.ВКМ_НазначениеСотрудниковНаДолжности КАК ВКМ_НазначениеСотрудниковНаДолжности
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВКМ_НазначениеСотрудниковНаДолжности.ДолжностиСотрудников КАК ВКМ_НазначениеСотрудниковНаДолжностиВКМ_ДолжностиСотрудников
		|		ПО (ВКМ_НазначениеСотрудниковНаДолжностиВКМ_ДолжностиСотрудников.Ссылка = ВКМ_НазначениеСотрудниковНаДолжности.Ссылка)
		|ГДЕ
		|	ВКМ_НазначениеСотрудниковНаДолжности.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Движения.ВКМ_ДолжностиСотрудников.Записывать = Истина;
		
		Пока Выборка.Следующий() Цикл
			Движение = Движения.ВКМ_ДолжностиСотрудников.Добавить();
			Движение.Период = Выборка.ДатаНазначения;
			Движение.Сотрудник = Выборка.Сотрудник;
			Движение.Должность = Выборка.Должность;
			Движение.Подразделение = Выборка.Подразделение; 
			Движение.ТабельныйНомер = Выборка.ТабельныйНомер;
		КонецЦикла;
		
	КонецПроцедуры
	
	Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
		
		Ответственный = Пользователи.ТекущийПользователь();  
		
	КонецПроцедуры
	
	#КонецОбласти
	
#КонецЕсли
